/*
███████╗  ██╗   ██╗ ███████╗ ███████╗ ███╗   ██╗       ███   █████████    ███     ███    ███     ███
██╔═══██╗ ██║   ██║ ██╔════╝ ██╔════╝ ████╗  ██║       ███   ███          ███     ███    ███     ███
██║   ██║ ██║   ██║ █████╗   █████╗   ██╔██╗ ██║       ███   █████████    ███████████    ███     ███
██║▄▄ ██║ ██║   ██║ ██╔══╝   ██╔══╝   ██║╚██╗██        ███         ███    ███     ███    ███████████
╚██████╔╝ ╚██████╔╝ ███████╗ ███████╗ ██║ ╚████║       ███   █████████    ███     ███      ███████
created by laksidu
 DONT COPY
*/

const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')

cmd({
    pattern: "alive",
    alias: ["list"],
    desc: "menu the bot",
    react: "👋",
    category: "main"
},
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let desc = `*👋 Hello ${pushname}*

*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`;

        const vv = await conn.sendMessage(from, { image: { url: "https://i.imgur.com/dUav9x3.jpeg"}, caption: desc }, { quoted: mek });

        conn.ev.on('messages.upsert', async (msgUpdate) => {
            const msg = msgUpdate.messages[0];
            if (!msg.message || !msg.message.extendedTextMessage) return;

            const selectedOption = msg.message.extendedTextMessage.text.trim();

            if (msg.message.extendedTextMessage.contextInfo && msg.message.extendedTextMessage.contextInfo.stanzaId === vv.key.id) {
                switch (selectedOption) {
                    case '1':
                        reply(`*🩸⃟༑ALL COMMAND SEND .MENU🩸⃟*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
╭━❮ 𝙲𝙾𝙽𝚅𝙴𝚁𝚃𝙴𝚁 ❯━╮
┃✰ .𝚂𝚝𝚒𝚌𝚔𝚎𝚛
╰━━━━━━━━━━━━━━━⪼
╭━❮ 𝙰𝙸 ❯━╮
┃✰ .𝙰𝚒
╰━━━━━━━━━━━━━━━⪼
╭━❮ 𝙶𝚁𝙾𝚄𝙿 ❯━╮
┃✰ 𝙻𝚒𝚗𝚔𝙶𝚛𝚘𝚞𝚙
┃✰ 𝚂𝚎𝚝𝚙𝚙𝚐𝚌
┃✰ .𝚂𝚎𝚝𝚗𝚊𝚖𝚎
┃✰ .𝚂𝚎𝚝𝚍𝚎𝚜𝚌
┃✰ .𝙶𝚛𝚘𝚞𝚙
┃✰ .𝚂𝚎𝚝𝚐𝚘𝚘𝚍𝚋𝚞𝚢
┃✰ .𝚂𝚎𝚝𝚠𝚎𝚕𝚌𝚘𝚖𝚎
┃✰ .𝙰𝚍𝚍
┃✰ .𝚁𝚎𝚖𝚘𝚟𝚎
┃✰ .𝙿𝚛𝚘𝚖𝚘𝚝𝚎
┃✰ .𝙳𝚎𝚖𝚘𝚝𝚎
╰━━━━━━━━━━━━━━━⪼
╭━❮ 𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳 ❯━╮
┃✰ .𝙵𝚊𝚌𝚎𝚋𝚘𝚘𝚔
┃✰ .𝙼𝚎𝚍𝚒𝚊𝚏𝚒𝚛𝚎
┃✰ .𝙶𝚍𝚛𝚒𝚟𝚎
┃✰ .𝙸𝚗𝚜𝚝𝚊
┃✰ .𝚂𝚘𝚗𝚐
┃✰ .𝚅𝚒𝚍𝚎𝚘
┃✰ .𝚈𝚝𝚖𝚙3𝚍𝚘𝚌
┃✰ .𝚈𝚝𝚖𝚙4𝚍𝚘𝚌
┃✰ .𝚃𝚒𝚔𝚝𝚘𝚔
╰━━━━━━━━━━━━━━━⪼
╭━❮ 𝙼𝙰𝙸𝙽 ❯━╮
┃✰ .𝙿𝚒𝚗𝚐
┃✰ .𝙰𝚕𝚒𝚟𝚎
┃✰ .𝙾𝚠𝚗𝚎𝚛
┃✰ .𝙼𝚎𝚗𝚞
|✰ .𝚁𝚎𝚙𝚘
╰━━━━━━━━━━━━━━━⪼
*ALL COMMAND SEND .MENU`);
                        break;
                    case '2':               
                        reply(`╔══════✮❁•°♛°•❁✮ ══════╗
*QUEEN-ISHU-MD-SYSTERM*

*UPTIME:➠  56 minutes, 2 seconds*

*RAM USAGE:➠ 80.00MB / 63276MB*

*HOSTNAME:➠ 55883f65-3d07-4bc2-b842-37cac3ce8e0b*

*OWNER:➠ LAKSIDU NIMSARA*
╚══════✮❁•°❀°•❁✮═══════╝`);
                        break;
                    case '3':               
                        reply(`*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`);
                        break;
                    case '4':               
                        reply(`*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`);
                        break;
                    case '5':               
                        reply(`*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`);
                        break;
                    case '6':               
                        reply(`*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`);
                        break;
                    case '7':               
                        reply(`*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`);
                       break;
                    case '8':               
                        reply(`*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`);

                        break;
                    case '10':               
                        reply(`*╔════════✮❁•°♛°•❁✮ ═══╗*
 *👀𝐐𝐔𝐄𝐄𝐍 𝐈𝐒𝐇𝐔 𝐀𝐋𝐈𝐕𝐄 𝐍𝐎𝐖🌝*
*╚═══════✮❁•°♛°•❁✮ ════╝*
🩸⃟༑⌁⃰⃰🅠🅤🅔🅔🅝 🅘🅢🅗🅤 🅜🅓梨🐉
*___________________________*
*┃ 🔥ʙᴏᴛ ɴᴀᴍᴇ: Qᴜᴇᴇɴ ɪꜱʜᴜ* 
*┃ 🔥ᴠᴇʀꜱᴏɴ: 2.5*
*┃ 🔥ᴏᴡɴᴇʀ:ʟᴀᴋɪʏᴀ ᴏꜰꜰɪᴄɪᴀʟ*
*____________________________*
*┏────────────────────*
*💜 "ලස්සනට ආදරේ විදින්න උඹ අකුරෙන් අකුර මට හුරු කලාට..."*
*💜උඹට අමතක උනා මැණික මට තනියෙන් ඉන්න පුරුදු කරන්න🙂❤️‍🩹*
*💜 ඒ නිසා මන් අදටත් රැයක් දවාලක් නැතුව තනිකම එක්ක යාලු වෙන්න පොරබදනව😔*
*╰─────────────────────*

┏━⬣🔢ℝ𝔼ℙ𝕃𝕐 ℕ𝕌𝕄𝔹𝔼ℝ🔢
┃ *1 || [ ᴄᴏᴍᴍᴀɴᴅ ᴘᴀɴᴇʟ ]*
┃
┃ *2 || [ Qᴜᴇᴇɴ ɪꜱʜᴜ ꜱʏꜱᴛᴇᴍ ]*
┗━━⬣🩸⃟༑⌁⃰梨🐉 ⌟  
 ⓿ᴄʀᴇᴀᴛᴇ ʙʏ ʟᴀᴋꜱɪᴅᴜ ɴɪᴍꜱᴀʀᴀ⓿`);


                        break;
                    default:
                        reply("Invalid option. Please select a valid option🔴");
                }

            }
        });

    } catch (e) {
        console.error(e);
        await conn.sendMessage(from, { react: { text: '❌', key: mek.key } })
        reply('An error occurred while processing your request.');
    }
});
